[
    {
        "headline": "Gautam Adani's salary was less than his peers and executives in FY24. Here's how much he got",
        "text": "Billionaire Gautam Adani's salary was less than his top executives and peers in FY24, receiving Rs 9.26 crore in compensation. The chairman of the Adani Group drew a salary from only two companies out of the 10 listed entities in his ports-to-energy conglomerate, as disclosed by the annual reports .The billionaire received Rs 2.19 crore in salary and Rs 27 lakh in perquisites, allowances, and other benefits from Adani Enterprises Ltd (AEL) in 2023-2024 whereas he received Rs 6.8 crore from Adani Ports and SEZ Ltd (APSEZ), including Rs 1.8 crore salary and Rs 5 crore commission.However, he did not get any commission from AEL.Meanwhile, Vinay Prakash, key executive and director on AEL board, drew a total remuneration of Rs 89.37 crore whereas Group CFO Jugeshinder Singh earned Rs 9.45 crore.Adani Green Energy Ltd CEO Vneet S Jaain received Rs 15.25 crore while Adani Total Gas Ltd (ATGL) CEO Suresh P Manglani drew Rs 6.88 crore. Adani Wilmar CEO Angshu Mallick earned Rs 5.15 crore.\"We reported an average remuneration increase of 12 per cent for employees, excluding key managerial personnel (KMPs), with a slightly higher increase of 5.37 per cent for KMPs,\" said AEL in its annual report said.Moreover, his salary is less than the heads of nearly all large family-owned conglomerates in India, including Sunil Bharti Mittal (Rs 16.7 crore in 2022-23), Rajiv Bajaj (Rs 53.7 crore), Pawan Munjal (Rs 80 crore), L&T Chairman S N Subrahmanyan, and Infosys CEO Salil S Parekh. Meanwhile, Mukesh Ambani has foregone his entire salary since the onset of Covid-19 (prior to which he had capped his remuneration at Rs 15 crore).Additionally, Rajesh Adani, Gautam's younger brother, received Rs 8.37 crore, which included Rs 4.71 crore commission on profit from AEL. Pranav Adani, Gautam's nephew, drew Rs 6.46 crore, including Rs 4.5 crore commission.His son Karan earned Rs 3.9 crore from APSEZ. However, Gautam Adani's brother, nephew, and son did not draw salaries from more than one company.Gautam Adani has been lately competing with Mukesh Ambani for the title of the wealthiest individual in Asia. His current net worth stands at $106 billion, according to the Bloomberg Billionaire Index.In 2022, he became the richest person in Asia, but faced a massive setback when Hindenburg Research released a report that erased more than $150 billion from the market value of his group's stock at its lowest point last year.",
        "summary": "The chairman of the Adani Group drew a salary from only two companies out of the 10 listed entities in his ports-to-energy conglomerate. The billionaire received Rs 2.19 crore in salary and Rs 27 lakh in perquisites, allowances, and other benefits in 2023-2024. His salary is less than the heads of nearly all large family-owned conglomerates in India. Mukesh Ambani has foregone his entire salary since the onset of Covid-19. Gautam Adani's brother, nephew, and son did not draw salaries from more than one company. In 2022, he became the richest person in Asia, but faced a massive setback when Hindenburg Research released a report that erased more than $150 billion from the market value of his group's stock. His current net worth stands at $106 billion, according to the Bloomberg Billionaire Index.",
        "category": "Business",
        "image": "https://static.toiimg.com/thumb/msid-111206298,width-1070,height-580,imgsize-594012,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "url": "https://timesofindia.indiatimes.com/business/india-business/gautam-adanis-salary-was-less-than-his-peers-and-executives-in-fy24-heres-how-much-he-got/articleshow/111206059.cms",
        "source": "https://timesofindia.indiatimes.com"
    }
]