[
    {
        "headline": "Kalki 2898 AD advance booking day 1: Amitabh Bachchan, Prabhas film earns over ₹8.2 cr, sells more than 2.8 lakh tickets",
        "text": "Fans are eagerly awaiting the release of the sci-fi film Kalki 2898 AD. As per a Sacnilk.com report, the film has so far minted over ₹8 crore in advance bookings for its opening day. The film has been helmed by Nag Ashwin and will hit the theatres on June 27. (Also Read | Kalki 2898 AD: Telangana government approves extra shows and hiked ticket prices; movie buffs react) Deepika Padukone, Prabhas, and Amitabh Bachchan will star in Kalki 2898 AD.\n\nKalki 2898 AD advance bookings\n\nAccording to the report, 265035 tickets of the film have been sold for 1726 shows, and it grossed ₹7.7 crore in Telugu (3D, 2D and IMAX 3D). In Hindi, 13833 tickets of the film have been sold for 1738 shows, and it grossed ₹43.6 lakh (in 3D, 2D and IMAX 3D). In Tamil (in 3D, 2D), 2925 tickets of the film were sold for 278 shows, and it earned ₹5.12 lakh gross.\n\nGet ready to catch the final stages of the World Cup only on Crickit. Anytime, Anywhere. Explore now!\n\nIn Kannada, it sold 101 tickets for 32 shows, grossing ₹23300, whereas in Malayam, it sold one ticket for one show, grossing ₹300. Numbers for both of them are for 2D. At the time of writing this report, the numbers across India are--281895 tickets sold for 3775 shows, grossing ₹8.22 crore.\n\nAbout Kalki 2898 AD\n\nThe film stars Amitabh Bachchan, Kamal Haasan, Deepika Padukone, Prabhas, and Disha Patani, among others. The post-apocalyptic film is inspired by Hindu scriptures and is set in the year 2898 AD. A trailer was recently unveiled. In it, Amitabh Bachchan's character, Ashwathama, tells Deepika Padukone's character, \"They say the whole universe resides within God. But God himself resides in your womb.\" More characters were also introduced in the second trailer.\n\nWhat Amitabh had said on working in Kalki 2898 AD\n\nRecently, the makers organised a grand event in Mumbai where actors including Amitabh Bachchan, Kamal Haasan, Deepika, Prabhas, and Rana Daggubati, among others, marked their presence. During the event, Amitabh shared his working experience in the film and how he felt after listening to the script. He also appreciated the director of the film Nag Ashwin for coming up with such a great concept.\n\nHe had said, \"Nagi came and explained the idea of Kalki 2898 AD. After he left, I thought, what the hell is Nagi drinking? To think of something like this is absolutely outrageous. Some of the visuals that you have seen just now are unbelievable. To have somebody conceive a project that is so futuristic is amazing. No matter what Nag Ashwin thought of, he actually got all the material and effects to match his vision. It has been an amazing experience working for Kalki 2898AD, which I will never forget.\"",
        "summary": "Kalki 2898 AD has so far minted over ₹8 crore in advance bookings for its opening day. The film has been helmed by Nag Ashwin and will hit the theatres on June 27. Deepika Padukone, Prabhas, and Amitabh Bachchan will star in the film. Kalki 2898 AD is a post-apocalyptic film inspired by Hindu scriptures. The film stars Amitabh Bachchan, Kamal Haasan, Deepika Padukone, Prabhas, and Disha Patani. A trailer was recently unveiled. He also appreciated the director of the film Nag Ashwin for coming up with such a great concept. He had said, \"Nagi came and explained the idea of Kalki 2898 AD. After he left, I thought, what the hell is Nagi drinking?\"",
        "category": "Entertainment",
        "image": "https://www.hindustantimes.com/ht-img/img/2024/06/24/1600x900/Kalki_2898_AD_new_trailer_1718980421831_1719218146564.jpg",
        "url": "https://www.hindustantimes.com/entertainment/telugu-cinema/kalki-2898-ad-advance-booking-day-1-amitabh-bachchan-prabhas-film-earns-over-8-2-cr-sells-more-than-2-8-lakh-tickets-101719214358664.html",
        "source": "https://www.hindustantimes.com"
    }
]