[
    {
        "headline": "\"INDIA bloc will contest Speaker, Dy Speaker elections,\" says RSP MP NK Premachandran",
        "text": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our Economic Times WhatsApp channel\n\nNew Delhi: Amid the row over the appointment of Bhartruhari Mahtab as pro-tem speaker, the Revolutionary Socialist Party's Lok Sabha MP, NK Premachandran, said that INDIA bloc will field candidates for the Lok Sabha Speaker and Deputy Speaker elections \"Definitely, we will contest the Speaker post as well as the Deputy Speaker post. Let the government come out with their opinion on whether they are going to discuss with the opposition parties so as to have a consensus on the Speaker and Deputy Speaker, and then we will think of it. Otherwise, we will definitely contest,\" Premchandran told outside the Parliament.Bhartruhari Mahtab was on Monday sworn in as the pro-tem Speaker of the 18th Lok Sabha. The oath was administered by President Droupadi Murmu at Rashtrapati Bhavan.The swearing-in ceremony marked the commencement of the 18th Lok Sabha's first session, which will begin with the oath-taking of the new MPs.On Prime Minister Narendra Modi's remarks on emergency, Premchandran alleged that the Centre attempted to rewrite the Constitution during their second term.\"In the last 10 years of the BJP government, the Constitution and constitutional institutions have been taken over. The independence of the constitutional autonomous institutions is being taken away. There was a strong move on the part of the government to change the Constitution...,\" the RSP MP said.\"So, to defend and protect the Constitution, the Opposition has symbolically put up the Constitution, and we said that we will never allow the Constitution to be drastically changed so as to make India a theocratic state. The secular democracy of India has to be protected; the principles and values of the parliamentary democracy have to be protected...,\" Premchandran said.Meanwhile, INDIA bloc leaders on Monday carried out a protest holding copies of the Constitution inside the Parliament premises in the national capital.Congress Parliamentary Party Chairperson Sonia Gandhi, party leader Rahul Gandhi, and party chief Mallikarjun Kharge took part in the protest.Congress MP Gaurav Gogoi said, \"The ruling party hasn't forgotten their haughtiness...we can see that they are ignoring the key subjects of the country...the whole Dalit community in India could witness a historic scene if K Suresh were appointed as Pro-tem Speaker...today, BJP has not just neglected Congress, INDIA alliance and K Suresh but the whole Dalit community...\"",
        "summary": " Revolutionary Socialist Party's Lok Sabha MP, NK Premachandran, said that INDIA bloc will field candidates for the Lok Sabha Speaker and Deputy Speaker elections. Bhartruhari Mahtab was on Monday sworn in as the pro-tem Speaker of the 18th Lok Sabha. Congress Parliamentary Party Chairperson Premchandran alleged that the Centre attempted to rewrite the Constitution during their second term. RSP MP said there was a strong move on the part of the government to change the Constitution. INDIA bloc leaders carried out a protest holding copies of the Constitution inside the Parliament premises in the national capital. Sonia Gandhi, party leader Rahul Gandhi, and party chief Mallikarjun Kharge took part in the protest. Congress MP Gaurav Gogoi said, \"The ruling party hasn't forgotten their haughtiness...we can see that they are ignoring the key subjects of the country\"",
        "category": "Politics",
        "image": "https://img.etimg.com/thumb/msid-111238556,width-1200,height-630,imgsize-19850,overlay-economictimes/photo.jpg",
        "url": "https://economictimes.indiatimes.com/news/politics-and-nation/india-bloc-will-contest-speaker-dy-speaker-elections-says-rsp-mp-nk-premachandran/articleshow/111238546.cms",
        "source": "https://economictimes.indiatimes.com"
    }
]