[
    {
        "headline": "A NASA Exercise Suggests 72% Chance An Asteroid May Hit Earth On This Day",
        "text": "There are no known significant asteroid threats in the foreseeable future. (representational)\n\nUS space agency NASA, in a hypothetical exercise, has found that a potentially hazardous asteroid has a 72% chance of hitting the Earth and we may not be adequately prepared to prevent it.\n\nAccording to an official report by the space agency, NASA conducted the fifth biennial Planetary Defense Interagency Tabletop Exercise in April. On June 20, NASA unveiled the summary of the exercise, held at the Johns Hopkins Applied Physics Laboratory (APL) in Laurel, Maryland.\n\nThe tabletop exercise, apart from NASA, included nearly 100 representatives from various US government agencies and international collaborators.\n\nWhile there are no known significant asteroid threats in the foreseeable future, this was done to assess the Earth's ability to respond effectively to the threat of a potentially hazardous asteroid.\n\nNASA stated that the hypothetical exercise also provided valuable insights about the risks, response options, and opportunities for collaboration posed by varying scenarios.\n\nThe planetary defence officer emeritus at NASA Headquarters in Washington, Lindley Johnson said, “The uncertainties in these initial conditions for the exercise allowed participants to consider a particularly challenging set of circumstances. A large asteroid impact is potentially the only natural disaster humanity has the technology to predict years in advance and take action to prevent.”\n\nThe Tabletop exercise summary noted, “During the exercise, participants considered potential national and global responses to a hypothetical scenario in which a never-before-detected asteroid was identified that had, according to initial calculations, a 72% chance of hitting Earth in approximately 14 years.”\n\nTo be precise, “72% chance of Earth impact on 12 July 2038 (14.25 years warning time).”\n\nHowever, this preliminary observation is not sufficient to precisely determine the asteroid's size, composition, and long-term trajectory, added NASA.\n\nTalking about the Earth's key gaps, the summary highlighted, “Decision-making processes and risk tolerance not understood. Limited readiness to quickly implement needed space missions. Timely global coordination of messaging needs attention. Asteroid-impact disaster management plans are not defined.”\n\nIt is worth noting that this was the first exercise to use data from NASA's DART (Double Asteroid Redirection Test) mission. DART is the first in-space demonstration of a technology for defending the planet against potential asteroid impacts.\n\nDART has also confirmed that a kinetic impactor could change the trajectory of an asteroid, stated NASA.\n\nThe report informed that in a bid to ensure that the Earth will have time to evaluate and respond to a potentially hazardous asteroid, NASA is developing NEO Surveyor (Near-Earth Object Surveyor).\n\nNEO Surveyor is an infrared space telescope. It is designed specifically to expedite humanity's ability to discover most of the potentially hazardous near-Earth objects many years before they could become an impact threat. NASA's NEO Surveyor will be launched in June 2028.",
        "summary": "NASA conducted the fifth biennial Planetary Defense Interagency Tabletop Exercise. The exercise was held at the Johns Hopkins Applied Physics Laboratory in Maryland. There are no known significant asteroid threats in the foreseeable future, according to the report. But the exercise provided valuable insights into how to prepare for such a threat. Asteroid has a 72% chance of hitting Earth in approximately 14 years. Asteroid impact is potentially the only natural disaster humanity has the technology to predict years in advance and take action to prevent. However, this preliminary observation is not sufficient to precisely determine the asteroid's size, composition, and long-term trajectory. The report informed that in a bid to ensure that the Earth will have time to evaluate and respond to a potentially hazardous asteroid, NASA is developing NEO Surveyor (Near-Earth Object Surveyor) It is designed specifically to expedite humanity's ability to discover most of the potentially hazardous near-Earth objects. NASA's NEO Surveyor will be launched in June 2028. hey could become an impact threat. NASA's NEO surveyor will launch on June 20, 2028, and will orbit the Earth for three years. It will be the first time the Earth has been directly in contact with an object in its orbit.",
        "category": "Sci/Tech",
        "image": "https://c.ndtvimg.com/2024-05/3jjudlqg_asteroid_625x300_13_May_24.jpeg",
        "url": "https://www.ndtv.com/science/nasa-exercise-finds-asteroid-with-72-chance-of-hitting-earth-5950284",
        "source": "https://www.ndtv.com"
    },
    {
        "headline": "'Space Potato': NASA Shares Image Of Mars' Moon Phobos, Netizens React",
        "text": "\"The Martian moon Phobos stands against the darkness of space. The moon is brownish-red and lumpy, pocketed with a number of craters of all sizes. A white patch is visible next to Stickney crater, a particularly large crater on its right side,\" said the image description shared by NASA.\n\nThe Instagram post has garnered over 4,20,000 likes and over 1,500 comments.\n\n\"Really it is a potato NASA,\" a user commented. \"I see now that Phobos was the inspiration for the food Matt Damon's character would grow out of own excrement in the film The Martian,\" another said.\n\n\"Oh, I think there is everything in space,\" a third user joked.\n\n\"Strong gravity causes sphere shape. How lucky we are, having a sphere moon around us, not a potato one,\" wrote another.",
        "summary": "The Instagram post has garnered over 4,20,000 likes and over 1,500 comments. \"I see now that Phobos was the inspiration for the food Matt Damon's character would grow out of own excrement in the film The Martian,\" one user said.",
        "category": "Sci/Tech",
        "image": "https://media.assettype.com/bloombergquint%2F2024-06%2F40c8df8f-ec6a-46c8-9325-d958f4a67979%2FPotato.jpg?w=1200&auto=format%2Ccompress&ogImage=true",
        "url": "https://www.ndtvprofit.com/trending/space-potato-nasa-shares-image-of-mars-moon-phobos-netizens-react",
        "source": "https://www.ndtvprofit.com"
    },
    {
        "headline": "Nasa overlooked minor leak in Boeing starliner pre-launch, leaving astronauts stranded at ISS: Report",
        "text": "Prior to the launch of the Starliner rocket on June 5, Nasa and Boeing officials were aware of a helium leak but deemed it too minor to pose a safety risk to the spacecraft. However, once in orbit, the Starliner developed four additional helium leaks, rendering one thruster unusable. As a result, the return trip for astronauts Butch Wilmore and Sunita Williams has been postponed until at least July 2, pending further analysis and testing of the leaks and thruster failures, according to a report from CBS.Nasa plans to conduct a formal re-entry readiness review before determining a new landing target date. The delay in the Starliner's undocking and return to Earth is likely to extend beyond two planned space station spacewalks on Monday and July 2. Despite the setbacks, Nasa officials maintain that Wilmore and Williams are not stranded in orbit and are cleared to undock and return home at any time if a station malfunction or other issue necessitates a quick departure.Boeing has faced significant criticism over the Starliner's current situation, compounding the company's existing troubles following high-profile malfunctions of its planes over the past year. At least 20 whistleblowers have come forward to express concerns about safety and quality issues at the aerospace giant.Steve Stich, manager of Nasa's Commercial Crew Program, said, \"We are taking our time and following our standard mission management team process.\" He emphasised that the decision-making process is driven by data and that an agency-level review, similar to the one conducted before the Nasa's SpaceX Demo-2 return after two months in orbit, will be completed to document the agency's formal acceptance of proceeding as planned.Despite the issues, Stich asserted that Nasa still has confidence in Starliner, claiming that the spacecraft is \"performing well in orbit while docked to the space station.\" However, the ongoing tests and issues raise doubts about Starliner's ability to complete its six-hour return trip.Boeing has incurred approximately $1.5 billion in cost overruns beyond the initial $4.5 billion contract it secured with Nasa, which aims to establish Starliner as its second mode of transportation to the ISS, alongside SpaceX's Crew Dragon.",
        "summary": "Nasa and Boeing officials were aware of a helium leak prior to launch. The leak was deemed too minor to pose a safety risk to the spacecraft. However, once in orbit, the Starliner developed four additional helium leaks. As a result, the return trip for astronauts Butch Wilmore and Sunita Williams has been postponed. Steve Stich, manager of Nasa's Commercial Crew Program, said, \"We are taking our time and following our standard mission management team process\" Stich asserted that Nasa still has confidence in Starliner, claiming that the spacecraft is \"performing well in orbit while docked to the space station\" Starliner will be the second mode of transportation to the ISS, alongside SpaceX's Crew Dragon. The $4.5 billion contract with Nasa is expected to see a $1. llion in cost overruns beyond the initial $4 billion.",
        "category": "Sci/Tech",
        "image": "https://static.toiimg.com/thumb/msid-111216987,width-1070,height-580,imgsize-1167432,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "url": "https://timesofindia.indiatimes.com/home/science/nasa-overlooked-minor-helium-leak-in-boeing-starliner-pre-launch-leaving-sunita-williams-butch-wilmore-stranded-at-iss-report/articleshow/111216994.cms",
        "source": "https://timesofindia.indiatimes.com"
    }
]