[
    {
        "headline": "United States vs England Live, T20 World Cup 2024 Super 8: Four-Down USA Struggle To Keep Going",
        "text": "USA vs England LIVE Updates, T20 World Cup 2024: USA are four down against England in their Super Eight match in Barbados. Earlier, England skipper Jos Buttler won the toss and opted to bowl first against USA. The defending champions picked Chris Jordan in place of Mark Wood in the only change to their line-up. USA skipper Aaron Jones said they are unchanged. (Live Scorecard | Points Table)\n\nEngland Playing XI: Philip Salt, Jos Buttler(w/c), Jonny Bairstow, Harry Brook, Moeen Ali, Liam Livingstone, Sam Curran, Chris Jordan, Jofra Archer, Adil Rashid, Reece Topley\n\nUnited States Playing XI: Steven Taylor, Andries Gous(w), Nitish Kumar, Aaron Jones(c), Corey Anderson, Milind Kumar, Harmeet Singh, Shadley van Schalkwyk, Nosthush Kenjige, Ali Khan, Saurabh Netravalkar",
        "summary": "England skipper Jos Buttler won the toss and opted to bowl first against USA. Defending champions picked Chris Jordan in place of Mark Wood in the only change to their line-up. USA skipper Aaron Jones said they are unchanged.",
        "category": "Sports",
        "image": "https://c.ndtvimg.com/2024-06/a6pu1umg_england-afp_625x300_23_June_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675",
        "url": "https://sports.ndtv.com/t20-world-cup-2024/united-states-vs-england-live-score-t20-world-cup-2024-super-8-group-2-usa-vs-eng-live-updates-5952229",
        "source": "https://sports.ndtv.com"
    },
    {
        "headline": "Naveen-ul-Haq does a Jasprit Bumrah after Afghanistan's incredible win, shares cryptic 'Support vs Congratulations' post",
        "text": "Rahmanullah Gurbaz and Ibrahim Zadran set the stage for Afghanistan's remarkable 21-run victory over Australia with a solid 118-run opening partnership in St Vincent on Saturday, keeping their hopes of reaching the T20 World Cup semi-finals alive. Australia, the 2021 champions, could have secured their place in the semi-finals along with India with a win, but even Pat Cummins' second consecutive hat-trick couldn’t preserve their unbeaten record in the tournament. Afghanistan's Naveen-ul-Haq bowls against Papua New Guinea during an ICC Men's T20 World Cup cricket match at Brian Lara Cricket Academy in Tarouba(PTI)\n\nHalf-centuries from Gurbaz and Zadran powered Afghanistan to a competitive total of 148-6 on a challenging Kingstown pitch. Afghanistan's bowlers then delivered a stellar performance, dismissing Australia for 127. Gulbadin Naib was the standout bowler with impressive figures of 4-20, while Naveen-ul-Haq contributed significantly with 3-20.\n\nNow catch your favourite game on Crickit. Anytime Anywhere. Find out how\n\nThe win not only kept Afghanistan’s semi-final hopes alive but also ensured that Bangladesh, too, remain in contention.\n\nNaveen, the star pacer, played a pivotal role in Afghanistan's triumph, taking three crucial wickets, including that of Australia skipper Mitchell Marsh. His performance was instrumental in restricting Australia to 127.\n\nFollowing the match, Naveen took to Instagram, posting a cryptic message that hinted at his disappointment with the criticism the team has faced in the past. His post subtly addressed the doubters, reflecting the team's resolve and determination to prove their critics wrong. Interestingly, India's leading pacer, Jasprit Bumrah, had also posted the same picture earlier this year in February as one of his Instagram stories after his brilliant performance in the second Test against England earned India a strong win.\n\nSee the post here:\n\n\"I can sleep better now, I think,\" Afghanistan captain Rashid Khan told the reporters after the historic win. \"That game kept coming in my mind ... Maxi, the way he played that night, took the game away from us and I didn't sleep the whole night.\n\n\"Tonight, because of the happiness I won't be able to sleep. That's how happy the whole team is and the whole country is. It's a massive win for us, as a team, as a nation.\n\n\"Cricket is the only source of happiness back home, we all know that. And I feel like we are so lucky to be here giving happiness to the people back home.\"",
        "summary": "Rahmanullah Gurbaz and Ibrahim Zadran set the stage for Afghanistan's remarkable 21-run victory over Australia. Australia could have secured their place in the semi-finals along with India with a win, but even Pat Cummins' second consecutive hat-trick couldn’t preserve their unbeaten record in the tournament. Naveen posted a cryptic message on Instagram after Afghanistan's win. The star pacer took three wickets, including that of Australia skipper Mitchell Marsh. His post subtly addressed the doubters, reflecting the team's resolve. India's leading pacer, Jasprit Bumrah, had also posted the same picture earlier this year in February. \"Cricket is the only source of happiness back home, we all know that,\" he says. \"I feel like we are so lucky to be here giving happiness to the people back home\" \"Tonight, because of the happiness I won't be able to sleep. That's how happy the whole team is and the whole country is\"",
        "category": "Sports",
        "image": "https://www.hindustantimes.com/ht-img/img/2024/06/23/1600x900/PTI06-14-2024-000043A-0_1719147972268_1719148006956.jpg",
        "url": "https://www.hindustantimes.com/cricket/naveenulhaq-does-a-jasprit-bumrah-after-afghanistans-incredible-win-shares-cryptic-support-vs-congratulations-post-101719141926083.html",
        "source": "https://www.hindustantimes.com"
    },
    {
        "headline": "West Indies dugout shellshocked, crowd silenced as Marco Jansen six scripts anticlimactic end to WI vs SA Super 8 tie",
        "text": "West Indies were left shell shocked and the home side's fans were silenced at the Sir Vivian Richards Stadium in Antigua on Sunday. The way South Africa clinched their three-wicket victory didn't justify how the game went on in the run chase. The West Indies dugout react to Marco Jansen's match-winning six.\n\nIt was a tough run chase for Aiden Markram and Co. and initially they were set a target of 136 runs and reached 15/2 in two overs, and West Indies looked like they were going to destroy the opposition's batting order.\n\nNow catch your favourite game on Crickit. Anytime Anywhere. Find out how\n\nBut rain happened after two overs and on resumption, the run chase was cut to 17 overs, with a revised DLS target of 123 runs. It looked easy initially, but West Indies stayed in the game and narrowed down the equation to five runs needed off six balls. In stepped Obed McCoy, and everyone expected to keep it tight for Marco Jansen and Kagiso Rabada, the way they had done until then.\n\nUntil the final over of the revised run chase, Jansen had only registered 15 runs off 13 balls and didn't look like he was in good batting touch. But the all-rounder had other plans and suddenly woke up in the final over!\n\nReceiving a slot delivery just outside off, Jansen planted his front foot and clobbered through the line, sending it over the long-on boundary for a match-winning six! It did not clear the boundary by much, but it was enough and it sent the South African dugout into a moment of pure ecstacy and elation, as they jumped up and down. Meanwhile, the co-hosts were left stunned and so were their fans, who expected it to be a victory. Their dugout was the perfect reflection as the coaching staff held their heads in disappointment.\n\nHere is the video:\n\nThe match began with Markram winning the toss and opting to bowl. West Indies reached 135/8 in 20 overs, courtesy of Roston Chase's (52) half-century. Meanwhile, Tabraiz Shamsi struck thrice for South Africa.\n\nChasing the revised target of 123 runs, South Africa reached 124/7 in 16.1 overs as Jansen (21*) remained unbeaten. For the West Indies' bowling department, Chase took three wickets. The win also sent South Africa to the semi-finals.",
        "summary": "South Africa beat West Indies by three wickets in Antigua. Aiden Markram and Co. reached 15/2 in two overs before rain stopped play. The run chase was cut to 17 overs, with a revised DLS target of 123. West Indies stayed in the game and narrowed down the equation to five runs needed off six balls. West Indies reached 135/8 in 20 overs, courtesy of Roston Chase's (52) half-century. South Africa reached 124/7 in 16.1, chasing the revised target of 123 runs. Jansen had only registered 15 runs off 13 balls and didn't look like he was in good batting touch. But the all-rounder woke up in the final over. The win also sent South Africa to the semi-finals. Jansen (21*) remained unbeaten. For the West Indies' bowling department, Chase took three wickets. South Africa will play Australia in the other semi-final on Friday.",
        "category": "Sports",
        "image": "https://www.hindustantimes.com/ht-img/img/2024/06/24/1600x900/wi_wi_wi_1719209783560_1719209797899.jpg",
        "url": "https://www.hindustantimes.com/cricket/west-indies-dugout-shellshocked-crowd-silenced-as-marco-jansen-six-scripts-anticlimactic-end-to-wi-vs-sa-super-8-tie-101719208802955.html",
        "source": "https://www.hindustantimes.com"
    },
    {
        "headline": "'Jis din gira denge...': Ajay Jadeja lauds Afghanistan for defeating Australia",
        "text": "T20 WORLD CUP:\n\n|\n\nJis Din Gira Denge, Us Din Ye (Afghanistan) Badi Team ho jaegi'. Lo Phir Australia ko bhi gira diya\n\nNEW DELHI: As Afghanistan defeated Australia by 21 runs in their T20 World Cup Super Eights clash on Sunday, praise poured in from all over the world on the historic victory.Former cricketers like Wasim Jaffer and Mohammad Kaif lauded the Afghans for their first ever win against Australia in any format.Ajay Jadeja , who was Afghanistan's team mentor in the ODI World Cup 2023, also heaped praise on the team.Jadeja posted on X, \"I already said - ', Congratulations @ACBofficials, many more to come.\"Chasing 149, Australia were bowled out for 127 runs in 19.2 overs with Gulbadin Naib taking 4/20 and Naveen-ul-Haq chipping in with 3/20.Afghanistan kept their semifinals hopes alive with this win.Australia now face a must-win game against India on Monday, with Afghanistan playing Bangladesh after that.",
        "summary": "Afghanistan defeated Australia by 21 runs in their T20 World Cup Super Eights clash on Sunday. It was Afghanistan's first ever win against Australia in any format. Former cricketers like Wasim Jaffer and Mohammad Kaif lauded the Afghans for their win.",
        "category": "Sports",
        "image": "https://static.toiimg.com/thumb/msid-111219386,width-1070,height-580,imgsize-91432,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/jis-din-gira-denge-ajay-jadeja-lauds-afghanistan-for-defeating-australia/articleshow/111219452.cms",
        "source": "https://timesofindia.indiatimes.com"
    },
    {
        "headline": "India vs Australia Weather And Pitch Report: Rain Threat Looms Large On T20 World Cup Super 8 Clash",
        "text": "Super Eight - Match 11 of the ICC Men's T20 World Cup, 2024 will be played between Australia and India (AUS vs IND) at the Daren Sammy National Cricket Stadium, Gros Islet, St Lucia on Monday. In the last match played by Australia, they lost to Afghanistan by 21 runs. The top fantasy player for Australia was Glenn Maxwell who scored 95 fantasy points. In India's last match in this tournament, they beat Bangladesh by 50 runs. The top fantasy player for India was Kuldeep Yadav who scored 105 fantasy points.\n\nPitch Report and Weather Conditions\n\nThe pitch at the Daren Sammy National Cricket Stadium, Gros Islet, St Lucia is balanced. The average 1st innings score at this venue in the last 20 matches is 115 runs. The team batting first at this venue has won 40% of its matches, so the toss does not make much of a difference here. The team winning the toss may decide to bat or bowl depending on the ground conditions today.\n\nWeather Report\n\nTemperature is expected to be around 29.08 degree C and humidity is expected to be around 77%. 8.52 m/s winds are expected. Cloud cover is also expected, so expect some movement to aid the pace bowlers. There is light rain expected which may affect playing conditions.\n\nPace or Spin?\n\nThe pacers have taken 75% of the total wickets at this venue. Hence picking up pacers for your fantasy team should be a good idea. Based on the stats available, We predict that the pitch will continue to assist the pacers.\n\nAdvertisement\n\nHead to Head\n\nIn the 31 matches played between these two teams, Australia bowlers have earned the most fantasy points for their team, while batters have earned the most fantasy points for India.\n\nAUS vs IND Fantasy Top Captain and Vice-Captain Picks\n\nMarcus Stoinis\n\nAdvertisement\n\nMarcus Stoinis is a fairly consistent player in terms of fantasy points. He has an average of 58 match fantasy points in the last 10 games and a fantasy rating of 8.8. Stoinis has smashed 167 runs in the recent six matches while the all-rounder has also taken eight wickets with the ball.\n\nVirat Kohli\n\nVirat Kohli is a good-to-have player for your Fantasy Team. He has an average of 43 match fantasy points in the last 10 games and a fantasy rating of 8.5. The right-handed batter has scored 66 runs in the recent five matches.\n\nAxar Patel\n\nAxar Patel is an all-rounder with an average of 55 match fantasy points in the last 10 games, a fantasy rating of 8.5 and can be a good safe pick for your Fantasy Team. The spin-bowling all-rounder has scored 35 runs in three innings while he has also taken four wickets with the ball.\n\nHardik Pandya\n\nHardik Pandya can be a good safe pick for your Fantasy Team. He has an average of 66 match fantasy points in the last 10 games and a fantasy rating of 8.3. The star all-rounder has scored 89 runs in three innings at an impressive strike rate of 141.26 while also picking eight wickets with the ball.\n\nTravis Head\n\nTravis Head is a top-order batter with an average of 32 match fantasy points in the last 10 games, a fantasy rating of 8.2 and can be a good pick for your Fantasy Team. The explosive left-handed batter has smashed 179 runs in the recent six matches at an impressive strike rate of 151.69.\n\nAUS vs IND Possible Playing XI\n\nAustralia (AUS) Possible Playing XI: David Warner, Travis Head, Tim David, Matthew Wade, Adam Zampa, Pat Cummins, Mitchell Starc, Josh Hazlewood, Marcus Stoinis, Glenn Maxwell and Mitchell Marsh\n\nIndia (IND) Possible Playing XI: Rishabh Pant, Suryakumar Yadav, Virat Kohli, Rohit Sharma, Arshdeep Singh, Jasprit Bumrah, Kuldeep Yadav, Hardik Pandya, Axar Patel, Ravindra Jadeja and Shivam Dube\n\nAUS vs IND Fantasy Team Today\n\nWicket-Keepers: Rishabh Pant and Matthew Wade\n\nBatters: Virat Kohli, Suryakumar Yadav, Travis Head and Mitchell Marsh\n\nAll-Rounders: Marcus Stoinis, Axar Patel and Hardik Pandya\n\nBowlers: Kuldeep Yadav and Pat Cummins\n\nCaptain: Jasprit Bumrah\n\nVice-Captain: Travis Head",
        "summary": "Match 11 of the ICC Men's T20 World Cup, 2024 will be played between Australia and India (AUS vs IND) at the Daren Sammy National Cricket Stadium, Gros Islet, St Lucia on Monday. In the last match played by Australia, they lost to Afghanistan by 21 runs. The top fantasy player for Australia was Glenn Maxwell who scored 95 fantasy points. In India's last match in this tournament, they beat Bangladesh by 50 runs. The pacers have taken 75% of the total wickets at this venue. We predict that the pitch will continue to assist the pacers. Marcus Stoinis is a fairly consistent player in terms of fantasy points. Australia bowlers have earned the most fantasy points for their team. Virat Kohli is a good-to-have player for your Fantasy Team. The right-handed batter has scored 66 runs in the recent five matches. Hardik Pandya has scored 89 runs in three innings at an impressive strike rate of 141.26. The explosive left-handed batter has smashed 179 runs in the recent six matches at an impressive strike rate of 151.69. David Warner, Travis Head, Tim David, Matthew Wade, Adam Zampa, Pat Cummins, Mitchell Starc, Josh Hazlewood, Marcus Stoinis, Glenn Maxwell and Mitchell Marsh.",
        "category": "Sports",
        "image": "https://c.ndtvimg.com/2024-06/up6fm68o_team-india_625x300_21_June_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675",
        "url": "https://sports.ndtv.com/t20-world-cup-2024/india-vs-australia-weather-and-pitch-report-rain-threat-looms-large-on-t20-world-cup-super-8-clash-5952684",
        "source": "https://sports.ndtv.com"
    }
]