[
    {
        "headline": "'NATO Will Pay...': Putin Roars As American ATACMS Missiles Kill Russians On Crimea Beach",
        "text": "Jun 24, 2024, 04:19PM IST\n\nSource: TOI.in\n\nThe brutal attack in Russia's Crimea has left Vladimir Putin exasperated. The Putin government has issued an ultimatum to NATO as 'U.S. weapon was used in attack.' The Russian Defence Ministry said that NATO will pay for the killing of innocent Russians. In an open threat to NATO, Moscow said such actions won't go unanswered. Watch this for more information.",
        "summary": "Putin government issues ultimatum to NATO as 'U.S. weapon was used in attack' Russian Defence Ministry said that NATO will pay for the killing of innocent Russians. In an open threat to NATO, Moscow said such actions won't go unanswered.",
        "category": "World",
        "image": "https://timesofindia.indiatimes.com/photo/msid-111231151,imgsize-73544.cms",
        "url": "https://timesofindia.indiatimes.com/videos/toi-original/nato-will-pay-putin-roars-as-american-atacms-missiles-kill-russians-on-crimea-beach/videoshow/111231151.cms",
        "source": "https://timesofindia.indiatimes.com"
    },
    {
        "headline": "\"Justice Served\": Indian CEO On Hindujas' Conviction For Exploiting Staff",
        "text": "The Hinduja family is ranked among India's richest\n\nAn Indian CEO has strongly endorsed a Swiss court decision to convict four members of Britain's richest family - the Hindujas - for exploiting domestic staff at their villa in Geneva.\n\nPrakash Hinduja and his wife Kamal Hinduja each got four years and six months in jail, while their son Ajay and his wife Namrata were handed four-year terms.\n\nThe family was, however, acquitted of the more serious charge of human trafficking, on the grounds that the workers had travelled to Switzerland willingly.\n\nThe Hindujas were accused of seizing the workers' passports, barring them from leaving the villa and forcing them to work very long hours for a pittance in Switzerland, among other things.\n\nCapital Mind CEO Deepak Shenoy reacted strongly to the Swiss Court ruling, saying it demonstrated that even the richest can't get away with such practices.\n\n\"Justice has been served. Even a rich family like the Hindujas can't get away from employment protection; you can't withhold passports, lock people in your house, make them work 18 hours per day, and still pay them peanuts. Jail terms and fines in Switzerland for the Hindujas,\" he posted on X - earlier known as Twitter.\n\nFour members of the richest family of Britain, Prakash Hinduja, his wife Kamal Hinduja, their son Ajay Hinduja and his wife Namrata Hinduja have all been sentenced to jail by a Swiss court for exploiting Indian migrant servants whom they made to work for upto 18 hours a day for… pic.twitter.com/JmyJW7Nrwq — Poonam Joshi (@PoonamJoshi_) June 21, 2024\n\nThe Hinduja family's defence lawyers argued that the three persons who had sued the family had received ample benefits, were not kept in isolation and were free to leave the villa.\n\n\"Per Swiss law procedures, the lower court's judgment is rendered ineffective and inoperative as the presumption of innocence is paramount until and unless a final judgment by the highest adjudicating authority is enforced,\" a family spokesperson said.\n\nHe said the none of the Hindujas have been imprisoned.\n\nThe Hinduja family, ranked among India's richest with an estimated net worth of $20 billion, controls the multinational conglomerate the Hinduja group, with interests in shipping, banking, media and other industries, besides real estate in London.",
        "summary": "Prakash Hinduja and his wife Kamal Hinduja each got four years and six months in jail. Their son Ajay and wife Namrata were handed four-year terms. The family was, however, acquitted of the more serious charge of human trafficking. Four members of the richest family of Britain, Prakash Hinduja, his wife Kamal Hinduja and their son Ajay Hinduja have all been sentenced to jail by a Swiss court. The Hinduja family's defence lawyers argued that the three persons who had sued the family had received ample benefits and were not kept in isolation. The Hinduja family, ranked among India's richest with an estimated net worth of $20 billion, controls the multinational conglomerate the Hinduja group. e been imprisoned. e have interests in shipping, banking, media and other industries, besides real estate in London.",
        "category": "World",
        "image": "https://c.ndtvimg.com/2024-06/uk20otj_hindujas-afp_625x300_22_June_24.jpeg",
        "url": "https://www.ndtv.com/india-news/even-a-rich-family-capitalmind-ceo-deepak-shenoy-on-hinduja-familys-conviction-for-exploiting-staff-5957738",
        "source": "https://www.ndtv.com"
    },
    {
        "headline": "Afghanistan vs Bangladesh Highlights, T20 World Cup 2024: Afghanistan Secure Historic T20 WC Semis Berth, Australia Out",
        "text": "Afghanistan vs Bangladesh Highlights, T20 World Cup 2024: Afghanistan sealed a famous win by 8 runs (via DLS method), in a dramatic rain-affected Super 8 encounter against Bangladesh. Australia are sent packing from the tournament, as they needed a Bangladesh win to qualify. This will be Afghanistan's first appearance at the semi-finals of a major ICC event. Despite Litton Das carrying the bat to the end with a battling half-century, Rashid Khan's four-wicket haul inspired Afghanistan to victory, defending a low total. Earlier, Rashid had also hit a 10-ball 19 run cameo with the bat, which took Afghanistan beyond the 100-run total. (SCORECARD)\n\nT20 World Cup 2024 Highlights: Afghanistan vs Bangladesh Highlights Straight From Arnos Vale Ground, Kingstown, St Vincent",
        "summary": "Afghanistan beat Bangladesh by 8 runs (via DLS method), in a dramatic rain-affected Super 8 encounter against Bangladesh. Australia are sent packing from the tournament, as they needed a Bangladesh win to qualify. This will be Afghanistan's first appearance at the semi-finals of a major ICC event.",
        "category": "World",
        "image": "https://c.ndtvimg.com/2024-06/nh4toju8_afghanistan-afp_625x300_25_June_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675",
        "url": "https://sports.ndtv.com/t20-world-cup-2024/afghanistan-vs-bangladesh-live-score-t20-world-cup-2024-super-8-52nd-match-today-ban-vs-afg-live-scorecard-xxx-xxx-5960864",
        "source": "https://sports.ndtv.com"
    }
]